Modulo 12/mv/app/views/movies/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 2]]
---

<% @movie.comments.each do |comment| %>