Modulo 12/mv/app/controllers/comments_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @comment = Comment.new
    @movie = Movie.find(params[:movie_id])
    @user = User.find(session[:user_id])

INSERT INTO "comments" ("author", "message", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Pepato"], ["message", "test"], ["movie_id", 2], ["created_at", "2016-04-06 20:14:25.273415"], ["updated_at", "2016-04-06 20:14:25.273415"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.movie_id = params[:movie_id]
    respond_to do |format|
      if @comment.save