Modulo 12/mv/app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "teste"], ["description", "teste"], ["created_at", "2016-04-11 23:17:57.794484"], ["updated_at", "2016-04-11 23:17:57.794484"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "picture_file_name" = ?, "picture_content_type" = ?, "picture_file_size" = ?, "picture_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)